arieger2/ESP32-Treadmill-IDF-PlatformIO/src/ESP32_treadmill_tacho_setup.cpp
// ============================================================================
// NVS Settings Implementation
// saveSettings/loadSettings/loadDefaultSettings/printSettings
// ============================================================================
#include "driver/gpio.h"
#include "driver/pulse_cnt.h"
#include "ESP32_treadmill_tacho_config.h"
#include "ESP32_treadmill_tacho_sensor.h"
#include "ESP32_treadmill_tacho_web.h"
#include "ESP32_treadmill_tacho_bootlog.h"
#include <nvs.h>
#include <nvs_flash.h>
#include "esp_system.h"
#include "esp_chip_info.h"
#include "spi_flash_mmap.h"

// Define the single instances
Preferences prefs;
TreadmillStoredGlobals storedGlobals;

// Define timer handles and busy flags
esp_timer_handle_t speedUpTimer = nullptr;
esp_timer_handle_t speedDownTimer = nullptr;
esp_timer_handle_t inclineUpTimer = nullptr;
esp_timer_handle_t inclineDownTimer = nullptr;
volatile bool speedUpBusy = false;
volatile bool speedDownBusy = false;
volatile bool inclineUpBusy = false;
volatile bool inclineDownBusy = false;

// Define key strings exactly once here
const char* NVSKeys::NS            = "treadmill";

const char* NVSKeys::WIFI_PASS     = "wifiPass";
const char* NVSKeys::WIFI_SSID     = "wifiSSID";
const char* NVSKeys::BLE_NAME      = "bleDeviceName";     // 13 (OK)

const char* NVSKeys::INT_PIN       = "interruptPin";      // 12 (OK)
const char* NVSKeys::MOTOR_INT_PIN = "mIntPin";           // was "motorInterruptPin"
const char* NVSKeys::SPEED_UP_PIN  = "speedUpPin";        // 11 (OK)
const char* NVSKeys::SPEED_DN_PIN  = "speedDownPin";      // 13 (OK)
const char* NVSKeys::INCL_UP_PIN   = "inclUpPin";         // was "inclineUpPin"
const char* NVSKeys::INCL_DN_PIN   = "inclDnPin";         // was "inclineDownPin"

const char* NVSKeys::TESTDATA_MS   = "testdataFreqMs";    // 14 (OK)

const char* NVSKeys::BELT_MM       = "beltDistanceMM";    // 14 (OK)
const char* NVSKeys::DEBOUNCE_US   = "debThUs";           // was "debounceThresholdUs"
const char* NVSKeys::MAXREV_MS     = "maxRevMs";          // was "maxRevolutionTimeUs"
const char* NVSKeys::PPR_BELT      = "pprBelt";           // was "pulsePerRevision"
const char* NVSKeys::PPR_MULT_BAND = "pprMultB";          // Band pulse multiplier
const char* NVSKeys::PPR_MULT_MTR  = "pprMultM";          // Motor pulse multiplier
const char* NVSKeys::FORCE_MOTOR   = "forceMtr";          // FORCE_USE_MOTOR flag
const char* NVSKeys::PPR_MOTOR     = "pprMotor";          // was "motorPulsesPerRev"

const char* NVSKeys::RATIO         = "ratio";             // was "motorToBeltRatio"
const char* NVSKeys::SENSOR_MODE   = "sensorSrc";         // NEW  <= short key like your others
const char* NVSKeys::BAND_FILTER   = "bandFlt";           // Band sensor filter type
const char* NVSKeys::MOTOR_FILTER  = "motorFlt";          // Motor sensor filter type

const char* NVSKeys::INERTIA_MS    = "inertiaMs";         // Stabilization delay after release

const char* NVSKeys::PID_KP        = "pidKp";
const char* NVSKeys::PID_KI        = "pidKi";
const char* NVSKeys::PID_KA        = "pidKa";
const char* NVSKeys::PID_KJ        = "pidKj";
const char* NVSKeys::PID_DEADZONE  = "pidDZ";
const char* NVSKeys::PID_LP_THRESH = "pidLPTh";
const char* NVSKeys::PID_I_CLAMP   = "pidIClamp";
const char* NVSKeys::PID_PULSE_CD  = "pidPulseCD";
const char* NVSKeys::PID_LP_MAX    = "pidLPMax";
const char* NVSKeys::PID_COAST_TH  = "pidCoastTh";
const char* NVSKeys::COAST_NEAR_MS = "coastNearMs";
const char* NVSKeys::COAST_FAR_MS  = "coastFarMs";
const char* NVSKeys::PID_BAND_IN   = "pidBandIn";
const char* NVSKeys::PID_BAND_OUT  = "pidBandOut";
const char* NVSKeys::CTRL_CMD_RATE = "cmdRate";
const char* NVSKeys::CTRL_UP_RATE  = "upRate";
const char* NVSKeys::CTRL_DN_RATE  = "dnRate";
const char* NVSKeys::CTRL_RSP_MS   = "rspDelayMs";
const char* NVSKeys::CTRL_INRT_UP  = "inrtUp";
const char* NVSKeys::CTRL_INRT_DN  = "inrtDn";

// Template function for putOrReplace - handles float, int, int32_t, uint32_t, int64_t, long
template<typename T>
static size_t putOrReplace(Preferences& p, const char* key, T value) {
  size_t written = 0;
  if (std::is_same<T, float>::value) {
    written = p.putFloat(key, static_cast<float>(value));
    if (written == 0) { p.remove(key); written = p.putFloat(key, static_cast<float>(value)); }
  } else if (std::is_same<T, int>::value || std::is_same<T, int32_t>::value) {
    written = p.putInt(key, static_cast<int32_t>(value));
    if (written == 0) { p.remove(key); written = p.putInt(key, static_cast<int32_t>(value)); }
  } else if (std::is_same<T, uint32_t>::value) {
    written = p.putUInt(key, static_cast<uint32_t>(value));
    if (written == 0) { p.remove(key); written = p.putUInt(key, static_cast<uint32_t>(value)); }
  } else if (std::is_same<T, int64_t>::value || std::is_same<T, long>::value) {
    written = p.putLong(key, static_cast<int64_t>(value));
    if (written == 0) { p.remove(key); written = p.putLong(key, static_cast<int64_t>(value)); }
  }
  return written;
}

// Specialization for String type
template<>
size_t putOrReplace<String>(Preferences& p, const char* key, String value) {
  size_t written = p.putString(key, value);
  if (written == 0) { p.remove(key); written = p.putString(key, value); }
  return written;
}

void systemInfo() {
  delay(1000);
  esp_chip_info_t chip_info;
  esp_chip_info(&chip_info);

  logPrint("=== ESP32 Chip Info ===\n");
  logPrintf("Chip model: %s\r\n", ESP.getChipModel());
  logPrintf("Chip revision: %d\r\n", ESP.getChipRevision());
  logPrintf("Cores: %d\r\n", ESP.getChipCores());
  logPrintf("CPU Freq: %u MHz\r\n", ESP.getCpuFreqMHz());
  logPrintf("Flash size: %u MB\r\n", ESP.getFlashChipSize() / (1024 * 1024));
  logPrintf("Flash speed: %u Hz\r\n", ESP.getFlashChipSpeed());
  logPrintf("PSRAM size: %u MB\r\n", ESP.getPsramSize() / (1024 * 1024));
  logPrintf("Heap size: %u KB\r\n", ESP.getHeapSize() / 1024);
  logPrintf("Free heap: %u KB\r\n", ESP.getFreeHeap() / 1024);
  logPrintf("Sketch size: %u KB\r\n", ESP.getSketchSize() / 1024);
  logPrintf("Free sketch space: %u KB\r\n", ESP.getFreeSketchSpace() / 1024);
  logPrintf("SDK Version: %s\r\n", ESP.getSdkVersion());

  logPrint("\r\nFeatures:\n");
  if (chip_info.features & CHIP_FEATURE_EMB_FLASH) logPrint(" - Embedded Flash\n");
  if (chip_info.features & CHIP_FEATURE_WIFI_BGN)  logPrint(" - WiFi BGN\n");
  if (chip_info.features & CHIP_FEATURE_BLE)       logPrint(" - BLE\n");
  if (chip_info.features & CHIP_FEATURE_BT)        logPrint(" - Classic BT\n");
}

// ============================================================================
// SETTINGS FUNCTIONS (unchanged)
// ============================================================================
String saveSettings() {
  prefs.begin(NVSKeys::NS, false);

  struct Row { const char* k; size_t w; };
  Row r[] = {
    {NVSKeys::RATIO,         putOrReplace(prefs, NVSKeys::RATIO,        storedGlobals.MOTOR_TO_BELT_RATIO)},
    {NVSKeys::WIFI_PASS,     putOrReplace(prefs, NVSKeys::WIFI_PASS,    storedGlobals.WIFI_PASSWORD)},
    {NVSKeys::WIFI_SSID,     putOrReplace(prefs, NVSKeys::WIFI_SSID,    storedGlobals.WIFI_SSID)},
    {NVSKeys::BLE_NAME,      putOrReplace(prefs, NVSKeys::BLE_NAME,     storedGlobals.BLE_DEVICE_NAME)},
    {NVSKeys::INT_PIN,       putOrReplace(prefs, NVSKeys::INT_PIN,      storedGlobals.INTERRUPT_PIN)},
    {NVSKeys::MOTOR_INT_PIN, putOrReplace(prefs, NVSKeys::MOTOR_INT_PIN,storedGlobals.MOTOR_INTERRUPT_PIN)},
    {NVSKeys::SPEED_UP_PIN,  putOrReplace(prefs, NVSKeys::SPEED_UP_PIN, storedGlobals.SPEED_UP_PIN)},
    {NVSKeys::SPEED_DN_PIN,  putOrReplace(prefs, NVSKeys::SPEED_DN_PIN, storedGlobals.SPEED_DOWN_PIN)},
    {NVSKeys::INCL_UP_PIN,   putOrReplace(prefs, NVSKeys::INCL_UP_PIN,  storedGlobals.INCLINE_UP_PIN)},
    {NVSKeys::INCL_DN_PIN,   putOrReplace(prefs, NVSKeys::INCL_DN_PIN,  storedGlobals.INCLINE_DOWN_PIN)},
    {NVSKeys::TESTDATA_MS,   putOrReplace(prefs, NVSKeys::TESTDATA_MS,  storedGlobals.TESTDATA_FREQ_MS)},
    {NVSKeys::BELT_MM,       putOrReplace(prefs, NVSKeys::BELT_MM,      storedGlobals.BELT_DISTANCE_MM)},
    {NVSKeys::DEBOUNCE_US,   putOrReplace(prefs, NVSKeys::DEBOUNCE_US,  storedGlobals.DEBOUNCE_THRESHOLD_US)},
    {NVSKeys::MAXREV_MS,     putOrReplace(prefs, NVSKeys::MAXREV_MS,    storedGlobals.MAX_REVOLUTION_TIME_MS)},
    {NVSKeys::PPR_BELT,      putOrReplace(prefs, NVSKeys::PPR_BELT,     storedGlobals.PULSES_PER_REV)},
    {NVSKeys::PPR_MULT_BAND, putOrReplace(prefs, NVSKeys::PPR_MULT_BAND,storedGlobals.BAND_PULSE_MULTIPLIER)},
    {NVSKeys::PPR_MULT_MTR,  putOrReplace(prefs, NVSKeys::PPR_MULT_MTR, storedGlobals.MOTOR_PULSE_MULTIPLIER)},
    {NVSKeys::FORCE_MOTOR,   putOrReplace(prefs, NVSKeys::FORCE_MOTOR,  (int32_t)storedGlobals.FORCE_USE_MOTOR)},
    {NVSKeys::PPR_MOTOR,     putOrReplace(prefs, NVSKeys::PPR_MOTOR,    storedGlobals.MOTOR_PULSES_PER_REV)},
    {NVSKeys::SENSOR_MODE,   putOrReplace(prefs, NVSKeys::SENSOR_MODE,  (int32_t)storedGlobals.SENSOR_SOURCE_MODE)},
    {NVSKeys::BAND_FILTER,   putOrReplace(prefs, NVSKeys::BAND_FILTER,  (int32_t)storedGlobals.BAND_FILTER_TYPE)},
    {NVSKeys::MOTOR_FILTER,  putOrReplace(prefs, NVSKeys::MOTOR_FILTER, (int32_t)storedGlobals.MOTOR_FILTER_TYPE)},
    {NVSKeys::INERTIA_MS,    putOrReplace(prefs, NVSKeys::INERTIA_MS,    storedGlobals.INERTIA_DELAY_MS)},
    {NVSKeys::PID_KP,        putOrReplace(prefs, NVSKeys::PID_KP,        storedGlobals.PID_Kp)},
    {NVSKeys::PID_KI,        putOrReplace(prefs, NVSKeys::PID_KI,        storedGlobals.PID_Ki)},
    {NVSKeys::PID_KA,        putOrReplace(prefs, NVSKeys::PID_KA,        storedGlobals.PID_Ka)},
    {NVSKeys::PID_KJ,        putOrReplace(prefs, NVSKeys::PID_KJ,        storedGlobals.PID_Kj)},
    {NVSKeys::PID_DEADZONE,  putOrReplace(prefs, NVSKeys::PID_DEADZONE,  storedGlobals.PID_DEAD_ZONE)},
    {NVSKeys::PID_LP_THRESH, putOrReplace(prefs, NVSKeys::PID_LP_THRESH, storedGlobals.PID_LONG_PRESS_THRESH)},
    {NVSKeys::PID_I_CLAMP,   putOrReplace(prefs, NVSKeys::PID_I_CLAMP,   storedGlobals.PID_I_CLAMP)},
    {NVSKeys::PID_PULSE_CD,  putOrReplace(prefs, NVSKeys::PID_PULSE_CD,  storedGlobals.PID_PULSE_COOLDOWN_MS)},
    {NVSKeys::PID_LP_MAX,    putOrReplace(prefs, NVSKeys::PID_LP_MAX,    storedGlobals.PID_LONG_PRESS_MAX_MS)},
    {NVSKeys::PID_COAST_TH,  putOrReplace(prefs, NVSKeys::PID_COAST_TH,  storedGlobals.PID_COAST_THRESHOLD)},
    {NVSKeys::COAST_NEAR_MS, putOrReplace(prefs, NVSKeys::COAST_NEAR_MS, storedGlobals.COAST_NEAR_MIN_MS)},
    {NVSKeys::COAST_FAR_MS,  putOrReplace(prefs, NVSKeys::COAST_FAR_MS,  storedGlobals.COAST_FAR_MIN_MS)},
    {NVSKeys::PID_BAND_IN,   putOrReplace(prefs, NVSKeys::PID_BAND_IN,   storedGlobals.PID_ERROR_BAND_ENTER_KMH)},
    {NVSKeys::PID_BAND_OUT,  putOrReplace(prefs, NVSKeys::PID_BAND_OUT,  storedGlobals.PID_ERROR_BAND_EXIT_KMH)},
    {NVSKeys::CTRL_CMD_RATE, putOrReplace(prefs, NVSKeys::CTRL_CMD_RATE, storedGlobals.CTRL_CMD_RATE_KMHPS)},
    {NVSKeys::CTRL_UP_RATE,  putOrReplace(prefs, NVSKeys::CTRL_UP_RATE,  storedGlobals.CTRL_BELT_RATE_UP_KMHPS)},
    {NVSKeys::CTRL_DN_RATE,  putOrReplace(prefs, NVSKeys::CTRL_DN_RATE,  storedGlobals.CTRL_BELT_RATE_DOWN_KMHPS)},
    {NVSKeys::CTRL_RSP_MS,   putOrReplace(prefs, NVSKeys::CTRL_RSP_MS,   storedGlobals.CTRL_RESPONSE_DELAY_MS)},
    {NVSKeys::CTRL_INRT_UP,  putOrReplace(prefs, NVSKeys::CTRL_INRT_UP,  storedGlobals.CTRL_INERTIA_UP_KMH)},
    {NVSKeys::CTRL_INRT_DN,  putOrReplace(prefs, NVSKeys::CTRL_INRT_DN,  storedGlobals.CTRL_INERTIA_DOWN_KMH)},
  };

  String out = "Settings saved:\r\n";
  String ret = "";
  for (auto &x: r) {
    out += (x.w > 0) ? "[OK]   " : "[WARN] ";
    out += x.k; out += " -> "; out += x.w; out += " bytes\r\n";
    if (x.w == 0) ret = "not saved - programming error"; 
  }
  
