arieger2/ESP32-Treadmill-IDF-PlatformIO/src/ESP32_treadmill_tacho_setup.cpp
  prefs.end();  // Close AFTER verification loop
  logPrint(out.c_str());
  return ret;
}

void loadSettings() {
  prefs.begin(NVSKeys::NS, false);

  storedGlobals.WIFI_PASSWORD   = prefs.getString(NVSKeys::WIFI_PASS, "");
  storedGlobals.WIFI_SSID       = prefs.getString(NVSKeys::WIFI_SSID,  "");
  storedGlobals.BLE_DEVICE_NAME = prefs.getString(NVSKeys::BLE_NAME,   "Rieger_Treatmill");

  storedGlobals.INTERRUPT_PIN        = prefs.getInt (NVSKeys::INT_PIN,       4);
  storedGlobals.MOTOR_INTERRUPT_PIN  = prefs.getInt (NVSKeys::MOTOR_INT_PIN, 6);
  storedGlobals.SPEED_UP_PIN         = prefs.getInt (NVSKeys::SPEED_UP_PIN, 10);
  storedGlobals.SPEED_DOWN_PIN       = prefs.getInt (NVSKeys::SPEED_DN_PIN, 11);
  storedGlobals.INCLINE_UP_PIN       = prefs.getInt (NVSKeys::INCL_UP_PIN,  12);
  storedGlobals.INCLINE_DOWN_PIN     = prefs.getInt (NVSKeys::INCL_DN_PIN,  13);

  storedGlobals.TESTDATA_FREQ_MS      = prefs.getUInt (NVSKeys::TESTDATA_MS, 10);
  storedGlobals.BELT_DISTANCE_MM      = prefs.getLong (NVSKeys::BELT_MM, 200);
  storedGlobals.DEBOUNCE_THRESHOLD_US = prefs.getLong (NVSKeys::DEBOUNCE_US, 13);
  storedGlobals.MAX_REVOLUTION_TIME_MS= prefs.getLong (NVSKeys::MAXREV_MS, 2000);
  storedGlobals.PULSES_PER_REV        = prefs.getLong (NVSKeys::PPR_BELT, 2);
  storedGlobals.BAND_PULSE_MULTIPLIER = prefs.getUInt (NVSKeys::PPR_MULT_BAND, 1);
  storedGlobals.MOTOR_PULSE_MULTIPLIER= prefs.getUInt (NVSKeys::PPR_MULT_MTR, 1);
  storedGlobals.MOTOR_PULSES_PER_REV  = prefs.getLong (NVSKeys::PPR_MOTOR, 12);
  storedGlobals.MOTOR_TO_BELT_RATIO   = prefs.getFloat(NVSKeys::RATIO, 0.413793);
  storedGlobals.FORCE_USE_MOTOR       = prefs.getBool (NVSKeys::FORCE_MOTOR, false);
  storedGlobals.SENSOR_SOURCE_MODE = (uint8_t)prefs.getInt(NVSKeys::SENSOR_MODE, (int32_t)SENSOR_AUTO);
  storedGlobals.BAND_FILTER_TYPE   = (uint8_t)prefs.getInt(NVSKeys::BAND_FILTER, 1);   // Default: EMA
  storedGlobals.MOTOR_FILTER_TYPE  = (uint8_t)prefs.getInt(NVSKeys::MOTOR_FILTER, 1);  // Default: EMA

  storedGlobals.INERTIA_DELAY_MS   = prefs.getUInt (NVSKeys::INERTIA_MS, 2000);

  storedGlobals.PID_Kp               = prefs.getFloat(NVSKeys::PID_KP,        1.0f);
  storedGlobals.PID_Ki               = prefs.getFloat(NVSKeys::PID_KI,        0.1f);
  storedGlobals.PID_Ka               = prefs.getFloat(NVSKeys::PID_KA,        2.0f);
  storedGlobals.PID_Kj               = prefs.getFloat(NVSKeys::PID_KJ,        0.5f);
  storedGlobals.PID_DEAD_ZONE        = prefs.getFloat(NVSKeys::PID_DEADZONE,  0.15f);
  storedGlobals.PID_LONG_PRESS_THRESH= prefs.getFloat(NVSKeys::PID_LP_THRESH, 1.0f);
  storedGlobals.PID_I_CLAMP          = prefs.getFloat(NVSKeys::PID_I_CLAMP,   3.0f);
  storedGlobals.PID_PULSE_COOLDOWN_MS= prefs.getUInt (NVSKeys::PID_PULSE_CD,  500);
  storedGlobals.PID_LONG_PRESS_MAX_MS= prefs.getUInt (NVSKeys::PID_LP_MAX,    15000);
  storedGlobals.PID_COAST_THRESHOLD  = prefs.getFloat(NVSKeys::PID_COAST_TH,  0.03f);
  storedGlobals.COAST_NEAR_MIN_MS    = prefs.getUInt (NVSKeys::COAST_NEAR_MS, 900);
  storedGlobals.COAST_FAR_MIN_MS     = prefs.getUInt (NVSKeys::COAST_FAR_MS,  200);
  storedGlobals.PID_ERROR_BAND_ENTER_KMH = prefs.getFloat(NVSKeys::PID_BAND_IN,  0.35f);
  storedGlobals.PID_ERROR_BAND_EXIT_KMH  = prefs.getFloat(NVSKeys::PID_BAND_OUT, 0.25f);
  storedGlobals.CTRL_CMD_RATE_KMHPS      = prefs.getFloat(NVSKeys::CTRL_CMD_RATE, 1.0f / 1.39f);
  storedGlobals.CTRL_BELT_RATE_UP_KMHPS  = prefs.getFloat(NVSKeys::CTRL_UP_RATE,  1.0f / 2.04f);
  storedGlobals.CTRL_BELT_RATE_DOWN_KMHPS= prefs.getFloat(NVSKeys::CTRL_DN_RATE,  1.0f / 2.04f);
  storedGlobals.CTRL_RESPONSE_DELAY_MS   = prefs.getUInt (NVSKeys::CTRL_RSP_MS,   400);
  storedGlobals.CTRL_INERTIA_UP_KMH      = prefs.getFloat(NVSKeys::CTRL_INRT_UP,  0.20f);
  storedGlobals.CTRL_INERTIA_DOWN_KMH    = prefs.getFloat(NVSKeys::CTRL_INRT_DN,  0.20f);

  logPrintf("[NVS] Loaded PID: Kp=%.2f Ki=%.2f Ka=%.2f Kj=%.2f DZ=%.2f\n",
                storedGlobals.PID_Kp, storedGlobals.PID_Ki, storedGlobals.PID_Ka,
                storedGlobals.PID_Kj, storedGlobals.PID_DEAD_ZONE);

  prefs.end();

  // Clamp to valid ranges
  if (storedGlobals.DEBOUNCE_THRESHOLD_US < 1) storedGlobals.DEBOUNCE_THRESHOLD_US = 1;
  if (storedGlobals.DEBOUNCE_THRESHOLD_US > 13) storedGlobals.DEBOUNCE_THRESHOLD_US = 13;
  
  if (storedGlobals.SENSOR_SOURCE_MODE > SENSOR_MOTOR) {
      storedGlobals.SENSOR_SOURCE_MODE = SENSOR_AUTO;
  }
  
  // Clamp filter types to valid range (0-3)
  if (storedGlobals.BAND_FILTER_TYPE > 3) storedGlobals.BAND_FILTER_TYPE = 1;
  if (storedGlobals.MOTOR_FILTER_TYPE > 3) storedGlobals.MOTOR_FILTER_TYPE = 1;
  
  // Clamp pulse multipliers to valid range (1-100)
  if (storedGlobals.BAND_PULSE_MULTIPLIER < 1) storedGlobals.BAND_PULSE_MULTIPLIER = 1;
  if (storedGlobals.BAND_PULSE_MULTIPLIER > 100) storedGlobals.BAND_PULSE_MULTIPLIER = 100;
  if (storedGlobals.MOTOR_PULSE_MULTIPLIER < 1) storedGlobals.MOTOR_PULSE_MULTIPLIER = 1;
  if (storedGlobals.MOTOR_PULSE_MULTIPLIER > 100) storedGlobals.MOTOR_PULSE_MULTIPLIER = 100;

  // Clamp control-model values to sane runtime ranges
  if (storedGlobals.PID_ERROR_BAND_ENTER_KMH < 0.10f) storedGlobals.PID_ERROR_BAND_ENTER_KMH = 0.10f;
  if (storedGlobals.PID_ERROR_BAND_ENTER_KMH > 1.00f) storedGlobals.PID_ERROR_BAND_ENTER_KMH = 1.00f;
  if (storedGlobals.PID_ERROR_BAND_EXIT_KMH < 0.05f) storedGlobals.PID_ERROR_BAND_EXIT_KMH = 0.05f;
  if (storedGlobals.PID_ERROR_BAND_EXIT_KMH >= storedGlobals.PID_ERROR_BAND_ENTER_KMH) {
      storedGlobals.PID_ERROR_BAND_EXIT_KMH = storedGlobals.PID_ERROR_BAND_ENTER_KMH * 0.70f;
  }

  if (storedGlobals.CTRL_CMD_RATE_KMHPS < 0.10f || storedGlobals.CTRL_CMD_RATE_KMHPS > 5.0f) {
      storedGlobals.CTRL_CMD_RATE_KMHPS = 1.0f / 1.39f;
  }
  if (storedGlobals.CTRL_BELT_RATE_UP_KMHPS < 0.05f || storedGlobals.CTRL_BELT_RATE_UP_KMHPS > 5.0f) {
      storedGlobals.CTRL_BELT_RATE_UP_KMHPS = 1.0f / 2.04f;
  }
  if (storedGlobals.CTRL_BELT_RATE_DOWN_KMHPS < 0.05f || storedGlobals.CTRL_BELT_RATE_DOWN_KMHPS > 5.0f) {
      storedGlobals.CTRL_BELT_RATE_DOWN_KMHPS = 1.0f / 2.04f;
  }
  if (storedGlobals.CTRL_RESPONSE_DELAY_MS < 50 || storedGlobals.CTRL_RESPONSE_DELAY_MS > 5000) {
      storedGlobals.CTRL_RESPONSE_DELAY_MS = 400;
  }
  if (storedGlobals.CTRL_INERTIA_UP_KMH < 0.0f || storedGlobals.CTRL_INERTIA_UP_KMH > 5.0f) {
      storedGlobals.CTRL_INERTIA_UP_KMH = 0.20f;
  }
  if (storedGlobals.CTRL_INERTIA_DOWN_KMH < 0.0f || storedGlobals.CTRL_INERTIA_DOWN_KMH > 5.0f) {
      storedGlobals.CTRL_INERTIA_DOWN_KMH = 0.20f;
  }
}

void loadDefaultSettings() {
    storedGlobals.WIFI_SSID = "";
    storedGlobals.WIFI_PASSWORD = "";
    storedGlobals.BLE_DEVICE_NAME = "Rieger_Treatmill";
    storedGlobals.INTERRUPT_PIN = 4;
    storedGlobals.MOTOR_INTERRUPT_PIN = 6;
    storedGlobals.SPEED_UP_PIN = 10;
    storedGlobals.SPEED_DOWN_PIN = 11;
    storedGlobals.INCLINE_UP_PIN = 12;
    storedGlobals.INCLINE_DOWN_PIN = 13;
    storedGlobals.TESTDATA_FREQ_MS = 10;
    storedGlobals.BELT_DISTANCE_MM = 200;
    storedGlobals.DEBOUNCE_THRESHOLD_US = 13;
    storedGlobals.MAX_REVOLUTION_TIME_MS = 2000;
    storedGlobals.PULSES_PER_REV = 2;
    storedGlobals.BAND_PULSE_MULTIPLIER = 1;
    storedGlobals.MOTOR_PULSE_MULTIPLIER = 1;
    storedGlobals.MOTOR_PULSES_PER_REV = 12;
    storedGlobals.MOTOR_TO_BELT_RATIO  = 0.413793;
    storedGlobals.FORCE_USE_MOTOR = true;
    storedGlobals.SENSOR_SOURCE_MODE = SENSOR_AUTO;
    storedGlobals.PID_Kp = 1.0f;
    storedGlobals.PID_Ki = 0.03f;
    storedGlobals.PID_Ka = 2.0f;
    storedGlobals.PID_Kj = 0.0f;
    storedGlobals.PID_DEAD_ZONE = 0.15f;
    storedGlobals.PID_LONG_PRESS_THRESH = 0.7f;
    storedGlobals.PID_I_CLAMP = 3.0f;
    storedGlobals.PID_PULSE_COOLDOWN_MS = 650;
    storedGlobals.PID_LONG_PRESS_MAX_MS = 15000;
    storedGlobals.PID_COAST_THRESHOLD = 0.03f;
    storedGlobals.COAST_NEAR_MIN_MS   = 900;
    storedGlobals.COAST_FAR_MIN_MS    = 200;
    storedGlobals.PID_ERROR_BAND_ENTER_KMH = 0.35f;
    storedGlobals.PID_ERROR_BAND_EXIT_KMH = 0.25f;
    storedGlobals.CTRL_CMD_RATE_KMHPS = 1.0f / 1.39f;
    storedGlobals.CTRL_BELT_RATE_UP_KMHPS = 1.0f / 2.04f;
    storedGlobals.CTRL_BELT_RATE_DOWN_KMHPS = 1.0f / 2.04f;
    storedGlobals.CTRL_RESPONSE_DELAY_MS = 400;
    storedGlobals.CTRL_INERTIA_UP_KMH = 0.20f;
    storedGlobals.CTRL_INERTIA_DOWN_KMH = 0.20f;
}

// Call this after loadSettings() / saveSettings()
void printSettings() {
  logPrint("===== TREADMILL SETTINGS (loaded) =====\n");
  logPrintf("WiFi SSID             : %s\r\n", storedGlobals.WIFI_SSID.c_str());
  logPrintf("WiFi Password         : %s\r\n", storedGlobals.WIFI_PASSWORD.c_str());
  logPrintf("BLE Device Name       : %s\r\n", storedGlobals.BLE_DEVICE_NAME.c_str());
  logPrint("\n");

  logPrint("Pins:\r\n"); 
  logPrintf("  Band Interrupt Pin  : %d\r\n", storedGlobals.INTERRUPT_PIN);
  logPrintf("  Motor Interrupt Pin : %d\r\n", storedGlobals.MOTOR_INTERRUPT_PIN);
  logPrintf("  Speed Up Pin        : %d\r\n", storedGlobals.SPEED_UP_PIN); 
  logPrintf("  Speed Down Pin      : %d\r\n", storedGlobals.SPEED_DOWN_PIN);
  logPrintf("  Incline Up Pin      : %d\r\n", storedGlobals.INCLINE_UP_PIN); 
  logPrintf("  Incline Down Pin    : %d\r\n", storedGlobals.INCLINE_DOWN_PIN);
  logPrint("\n");

