arieger2/ESP32-Treadmill-IDF-PlatformIO/src/ESP32_treadmill_tacho_setup.cpp
  logPrint("Timing:\r\n");
  logPrintf("  Testdata Freq (ms)  : %u\r\n", storedGlobals.TESTDATA_FREQ_MS); 
  logPrint("\n");

  logPrint("Mechanics:\r\n"); 
  logPrintf("  Belt Distance (mm)  : %lu\r\n", (unsigned long)storedGlobals.BELT_DISTANCE_MM); 
  logPrintf("  Debounce Thresh (us): %lu\r\n", (unsigned long)storedGlobals.DEBOUNCE_THRESHOLD_US); 
  logPrintf("  Max Rev Time (ms)   : %lu\r\n", (unsigned long)storedGlobals.MAX_REVOLUTION_TIME_MS); 
  logPrintf("  Pulses/Rev (belt)   : %lu\r\n", (unsigned long)storedGlobals.PULSES_PER_REV); 
  logPrintf("  Pulses/Rev (motor)  : %lu\r\n", (unsigned long)storedGlobals.MOTOR_PULSES_PER_REV); 
  logPrintf("  Motor→Belt Ratio    : %.6f\r\n", storedGlobals.MOTOR_TO_BELT_RATIO); 
  logPrintf("  Force Use Motor     : %s\r\n", storedGlobals.FORCE_USE_MOTOR ? "YES" : "NO"); 
  
  const char* src =
    (storedGlobals.SENSOR_SOURCE_MODE == SENSOR_BAND)  ? "BAND"  :
    (storedGlobals.SENSOR_SOURCE_MODE == SENSOR_MOTOR) ? "MOTOR" : "AUTO";
  logPrintf("  Speed Sensor Source : %s (%u)\r\n", src, storedGlobals.SENSOR_SOURCE_MODE);
  logPrint("=======================================\r\n\n");
}

// Add this function to check and fix NVS
void checkAndFixNVS() {
    logPrint("=== Borad Infos ===\n");
    systemInfo();
    logPrint("\n");
    logPrint("=== NVS DIAGNOSTIC ===\n");
    size_t sz = ESP.getFlashChipSize();  // bytes
    logPrintf("Flash size: %u bytes (%.2f MB)\r\n", (unsigned)sz, sz / (1024.0*1024.0));
    logPrint("\n");
    
    // Check NVS initialization
    esp_err_t err = nvs_flash_init();
    if (err == ESP_ERR_NVS_NO_FREE_PAGES || err == ESP_ERR_NVS_NEW_VERSION_FOUND) {
        logPrint("NVS partition was truncated and needs to be erased\n");
        // NVS partition was truncated and needs to be erased
        ESP_ERROR_CHECK(nvs_flash_erase());
        err = nvs_flash_init();
        logPrint("NVS erased and reinitialized\n");
    }
    ESP_ERROR_CHECK(err);
    
    // Get NVS statistics
    nvs_stats_t nvs_stats;
    err = nvs_get_stats(NULL, &nvs_stats);
    if (err == ESP_OK) {
        logPrint("NVS Statistics:\r\n");
        logPrintf("  Used entries: %d\r\n", nvs_stats.used_entries);
        logPrintf("  Free entries: %d\r\n", nvs_stats.free_entries);
        logPrintf("  Total entries: %d\r\n", nvs_stats.total_entries);
        logPrintf("  Namespace count: %d\r\n", nvs_stats.namespace_count);
    } else {
        logPrintf("Error getting NVS stats: %s\r\n", esp_err_to_name(err));
    }
    
    // Test preferences access
    Preferences testPrefs;
    bool canOpen = testPrefs.begin("test", false);
    if (canOpen) {
        logPrint("✅ Preferences can be opened for write\n");
        testPrefs.putString("test", "working");
        String result = testPrefs.getString("test", "failed");
        logPrintf("Write/Read test: %s\r\n", result.c_str()); 
        logPrint("\n");
        testPrefs.end();
    } else {
        logPrint("❌ Cannot open preferences for write\n");
    }
    
    // Test your treadmill namespace specifically
    bool canOpenTreadmill = testPrefs.begin("treadmill", false);
    if (canOpenTreadmill) {
        logPrint("✅ Treadmill namespace accessible\n");
        size_t freeEntries = testPrefs.freeEntries();
        logPrintf("Free entries in treadmill namespace: %d\r\n", freeEntries);
        testPrefs.end();
    } else {
        logPrint("❌ Cannot access treadmill namespace\n");
    }
    
    logPrint("======================\r\n\n");
}

// ============================================================================
// PIN AND HARDWARE SETUP
// ============================================================================
void pinModeSetup() {
    // Configure interrupt pins using native ESP-IDF
    // NO internal pull-up/down - using external stronger pull-up for long cable (1.5m)
    // Note: For PCNT, we don't need interrupts, just input mode
    gpio_config_t io_conf;
    io_conf.intr_type = GPIO_INTR_DISABLE;  // PCNT doesn't need GPIO interrupts
    io_conf.pin_bit_mask = (1ULL << storedGlobals.INTERRUPT_PIN) | (1ULL << storedGlobals.MOTOR_INTERRUPT_PIN);
    io_conf.mode = GPIO_MODE_INPUT;
    io_conf.pull_up_en = GPIO_PULLUP_ENABLE;     // Enable internal pull-up
    io_conf.pull_down_en = GPIO_PULLDOWN_DISABLE;
    gpio_config(&io_conf);
    
    // Reset GPIO to ensure clean state before PCNT takes over
    gpio_reset_pin((gpio_num_t)storedGlobals.INTERRUPT_PIN);
    gpio_reset_pin((gpio_num_t)storedGlobals.MOTOR_INTERRUPT_PIN);
    
    // Reconfigure after reset
    gpio_config(&io_conf);

    // Configure output pins for speed and incline control with ESP-IDF
    gpio_config_t out_conf = {};
    out_conf.intr_type = GPIO_INTR_DISABLE;
    out_conf.mode = GPIO_MODE_OUTPUT;
    out_conf.pin_bit_mask = (1ULL << storedGlobals.SPEED_UP_PIN) | 
                            (1ULL << storedGlobals.SPEED_DOWN_PIN) |
                            (1ULL << storedGlobals.INCLINE_UP_PIN) | 
                            (1ULL << storedGlobals.INCLINE_DOWN_PIN);
    out_conf.pull_down_en = GPIO_PULLDOWN_DISABLE;
    out_conf.pull_up_en = GPIO_PULLUP_DISABLE;
    gpio_config(&out_conf);
    
    // Set to HIGH (relay inactive) immediately after config
    gpio_set_level((gpio_num_t)storedGlobals.SPEED_UP_PIN, 1);
    gpio_set_level((gpio_num_t)storedGlobals.SPEED_DOWN_PIN, 1);
    gpio_set_level((gpio_num_t)storedGlobals.INCLINE_UP_PIN, 1);
    gpio_set_level((gpio_num_t)storedGlobals.INCLINE_DOWN_PIN, 1);
}

// Timer-Callbacks laufen im Timer-Task → Pin sicher loslassen
static void speedUpReleaseCb(void*) {
    speedUpBusy = false;
    gpio_set_level((gpio_num_t)storedGlobals.SPEED_UP_PIN, 1);  // HIGH = relay inactive
}

static void speedDownReleaseCb(void*) {
    speedDownBusy = false;
    gpio_set_level((gpio_num_t)storedGlobals.SPEED_DOWN_PIN, 1); // HIGH = relay inactive
}

static void inclineUpReleaseCb(void*) {
    inclineUpBusy = false;
    gpio_set_level((gpio_num_t)storedGlobals.INCLINE_UP_PIN, 1);  // HIGH = relay inactive
}

static void inclineDownReleaseCb(void*) {
    inclineDownBusy = false;
    gpio_set_level((gpio_num_t)storedGlobals.INCLINE_DOWN_PIN, 1); // HIGH = relay inactive
}

void pinTimerSetup() {
    esp_timer_create_args_t upArgs   = {.callback = &speedUpReleaseCb,   .arg=nullptr, .dispatch_method=ESP_TIMER_TASK, .name="upRel"};
    esp_timer_create_args_t dnArgs   = {.callback = &speedDownReleaseCb, .arg=nullptr, .dispatch_method=ESP_TIMER_TASK, .name="dnRel"};
    esp_timer_create_args_t incUpArgs   = {.callback = &inclineUpReleaseCb,   .arg=nullptr, .dispatch_method=ESP_TIMER_TASK, .name="incUpRel"};
    esp_timer_create_args_t incDnArgs   = {.callback = &inclineDownReleaseCb, .arg=nullptr, .dispatch_method=ESP_TIMER_TASK, .name="incDnRel"};
    esp_timer_create(&upArgs, &speedUpTimer);
    esp_timer_create(&dnArgs, &speedDownTimer);
    esp_timer_create(&incUpArgs, &inclineUpTimer);
    esp_timer_create(&incDnArgs, &inclineDownTimer);
}

void initTachometer() {
    pinModeSetup();
    pinTimerSetup();
    // Initialize new MCPWM + PCNT sensor system so GPTimer timeout callback runs
    esp_err_t err = speed_sensor1_init(storedGlobals.PULSES_PER_REV * storedGlobals.BAND_PULSE_MULTIPLIER,
                                       storedGlobals.INTERRUPT_PIN);
    if (err != ESP_OK) {
        logPrintf("[INIT][ERR] speed_sensor1_init failed: %s\r\n",
                      esp_err_to_name(err));
    }

    err = speed_sensor2_init(storedGlobals.MOTOR_PULSES_PER_REV * storedGlobals.MOTOR_PULSE_MULTIPLIER,
                             storedGlobals.MOTOR_INTERRUPT_PIN);
    if (err != ESP_OK) {
        logPrintf("[INIT][ERR] speed_sensor2_init failed: %s\r\n",
                      esp_err_to_name(err));
    }

    logPrintf("[INIT] Using new MCPWM+PCNT sensor system (GPIO %d, %d)\r\n",
                  storedGlobals.INTERRUPT_PIN, storedGlobals.MOTOR_INTERRUPT_PIN);
    logPrint("Hall sensor ready: Hardware ISR-based counting enabled\n");
    testdata = false;
}

void factoryReset() {
    // Fully erase the NVS partition
    esp_err_t err;
    err = nvs_flash_erase();
    Serial.printf("nvs_flash_erase: %s\r\n", esp_err_to_name(err));

    // Re-initialize NVS
    err = nvs_flash_init();
    Serial.printf("nvs_flash_init: %s\r\n", esp_err_to_name(err));
}

void resetWorkout() {
    uint32_t now = millis();

    metrics.mps = 0.0f;
    metrics.mpsSmooth = 0.0f;
    metrics.rpm = 0.0f;
    metrics.motorRPM = 0.0f;
    metrics.workoutDistance = 0.0f;

    metrics.targetSpeed = 0.0f;
    metrics.targetInclination = 0.0f;
    metrics.currentInclination = 0.0f;

    metrics.heartRateBpm = 0;
    metrics.rrLastMs = 0;
    metrics.heartRateEnergy = 0;
    metrics.heartRateLastUpdate = 0;
    metrics.rrBuffer.clear();
    metrics.hrBuffer.clear();

    metrics.isRunning = false;
    metrics.isPaused = false;
    metrics.controlRequested = false;

    metrics.sessionStartTime = now;
    metrics.workoutStartTime = now;
    metrics.lastUpdate = now;

    testdata = false;

    resetWorkoutTimer();
    resetMonitorViewState();

    Serial.println("Workout reset (global)");
}
